proc
flatten
synth
abc -g simple,-MUX
splitnets
stat
write_verilog -noexpr minhash_in.v
