proc
flatten
synth
abc -g simple,-MUX
splitnets
stat
write_verilog -noexpr ../yosys-netlists/minhash_in.v
